InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Замещение Тогда
		ЭлементКонструктора = Отбор.ЭлементКонструктора.Значение;
		Если ЗначениеЗаполнено(ЭлементКонструктора) Тогда
			ПараметрыЭлемента = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(ЭлементКонструктора);
			Если ПараметрыЭлемента.КаждомуВидуПродукцииСоответствуетОдноЗначение Тогда
				ВидыПродукции = Новый Массив;
				Для Каждого Запись Из ЭтотОбъект Цикл
					Если ЗначениеЗаполнено(Запись.ВидПродукции) Тогда
						Если ВидыПродукции.Найти(Запись.ВидПродукции) <> Неопределено Тогда
							СообщитьОбОшибкеКонтроляУникальности(Запись.ВидПродукции, Отказ);
							Возврат;
						КонецЕсли;
						ВидыПродукции.Добавить(Запись.ВидПродукции);
					КонецЕсли;
				КонецЦикла;
				ВыполнитьПроверкуКонтроляУникальностиПоВидуПродукции(ЭлементКонструктора, ВидыПродукции, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПроверкуКонтроляУникальностиПоВидуПродукции(ЭлементКонструктора, ВидыПродукции, Отказ)
	
	Если ВидыПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭлементКонструктора", ЭлементКонструктора);
	Запрос.УстановитьПараметр("ВидыПродукции", ВидыПродукции);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияЭлементовКонструктораВидовПродукцииИС.ВидПродукции
	|ИЗ
	|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктораВидовПродукцииИС
	|ГДЕ
	|	ЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &ЭлементКонструктора
	|	И ЗначенияЭлементовКонструктораВидовПродукцииИС.ВидПродукции В (&ВидыПродукции)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СообщитьОбОшибкеКонтроляУникальности(Выборка.ВидПродукции, Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура СообщитьОбОшибкеКонтроляУникальности(ВидПродукции, Отказ)
	
	ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(НСтр("ru = 'Значение для вида продукции %1 должно быть уникально'"),
		ВидПродукции),,,, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
